In [1]:
import pandas as pd

In [35]:
df = pd.read_csv("../../data/tj7s.csv", encoding="ISO-8859-1", sep=";", low_memory=False)

In [36]:
df.shape

(33329627, 12)

In [38]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 33329627 entries, 0 to 33329626
Data columns (total 12 columns):
 #   Column  Dtype
---  ------  -----
 0   COCO    object
 1   COMAX   object
 2   DDCO    object
 3   DFCO    object
 4   DACOEF  object
 5   DFCORE  object
 6   COPRO   object
 7   CTCOOV  object
 8   CTCOCL  object
 9   DDVALE  object
 10  DFVALE  object
 11  CESITC  int64
dtypes: int64(1), object(11)
memory usage: 3.0+ GB

In [39]:
df.head()

,COCO,COMAX,DDCO,DFCO,DACOEF,DFCORE,COPRO,CTCOOV,CTCOCL,DDVALE,DFVALE,CESITC
0,5856256c8621c,a4375be9c2,2018-02-15,9999-12-31,2018-02-15,9999-12-31,00049,00,,2018-02-15,9999-01-01,1
1,43e166b8ec1bf,ac68753a67,2016-01-22,9999-12-31,2016-01-22,9999-12-31,00049,00,,2016-01-22,9999-01-01,1
2,a33abb28b2dd1,e78af2a187,2015-08-19,9999-12-31,2015-08-19,9999-12-31,00049,00,,2015-08-19,9999-01-01,1
3,5923b9ac46620,730c4c47c5,2017-12-15,9999-12-31,2017-12-15,9999-12-31,00049,00,,2017-12-15,9999-01-01,1
4,b943bf9d03817,e31986ce26,2012-09-12,9999-12-31,2012-09-12,9999-12-31,00049,00,,2012-09-12,9999-01-01,1

In [40]:
# theses are the only columns that matters
df = df[['COCO', 'COMAX', 'COPRO' ]]

In [41]:
df.head()

            COCO       COMAX  COPRO
0  5856256c8621c  a4375be9c2  00049
1  43e166b8ec1bf  ac68753a67  00049
2  a33abb28b2dd1  e78af2a187  00049
3  5923b9ac46620  730c4c47c5  00049
4  b943bf9d03817  e31986ce26  00049

In [42]:
# to determine the products that we will use
# I picked all the products that passed the 100000
# not buying sum but frequency
temp = df['COPRO'].value_counts()

In [ ]:
# get the best selling products
temp.head(n=37)

In [44]:
# after inspecting we'll take only the first 37 product
temp = temp.index[0:37]

In [45]:
# take only the data that coreesponds to the selected products
df = df.loc[df['COPRO'].isin(temp)]

In [46]:
df.head()

                COCO       COMAX  COPRO
80029  5244b429daf31  6de50a0fab  00807
80030  5244b429daf31  6de50a0fab  00807
80031  5244b429daf31  6de50a0fab  00807
80032  5244b429daf31  6de50a0fab  00807
80033  5244b429daf31  6de50a0fab  00807

In [47]:
df.shape

(28685139, 3)

In [50]:
# store the data into a file call contracts.csv
df.to_csv('../../cleaned-data/cleaned/contracts.csv', sep='\t', index=False)